espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/inc/em_vdac.h
/** Channel conversion trigger mode. */
typedef enum {
  vdacTrigModeNone          = _VDAC_CH0CFG_TRIGMODE_NONE,           /**< No conversion trigger source selected. */
  vdacTrigModeSw            = _VDAC_CH0CFG_TRIGMODE_SW,             /**< Channel is triggered by CHnDATA or COMBDATA write. */
  vdacTrigModeSyncPrs       = _VDAC_CH0CFG_TRIGMODE_SYNCPRS,        /**< Channel is triggered by Sync PRS input. */
#if defined(LESENSE_PRESENT) && defined(_VDAC_CH0CFG_TRIGMODE_LESENSE)
  vdacTrigModeLesense       = _VDAC_CH0CFG_TRIGMODE_LESENSE,        /**< Channel is triggered by LESENSE. */
#endif
  vdacTrigModeInternalTimer = _VDAC_CH0CFG_TRIGMODE_INTERNALTIMER,  /**< Channel is triggered by Internal Timer. */
  vdacTrigModeAsyncPrs      = _VDAC_CH0CFG_TRIGMODE_ASYNCPRS        /**< Channel is triggered by Async PRS input. */
} VDAC_TrigMode_TypeDef;

/** Channel power mode. */
typedef enum {
  vdacPowerModeHighPower    = _VDAC_CH0CFG_POWERMODE_HIGHPOWER,     /**< High power buffer mode. */
  vdacPowerModeLowPower     = _VDAC_CH0CFG_POWERMODE_LOWPOWER       /**< Low power buffer mode. */
} VDAC_PowerMode_TypeDef;

/** VDAC channel Abus port selection. */
typedef enum {
  /** No GPIO selected.  */
  vdacChPortNone    = _VDAC_OUTCTRL_ABUSPORTSELCH0_NONE,
  /** Port A selected.  */
  vdacChPortA       = _VDAC_OUTCTRL_ABUSPORTSELCH0_PORTA,
  /** Port B selected.  */
  vdacChPortB       = _VDAC_OUTCTRL_ABUSPORTSELCH0_PORTB,
  /** Port C selected.  */
  vdacChPortC       = _VDAC_OUTCTRL_ABUSPORTSELCH0_PORTC,
  /** Port D selected.  */
  vdacChPortD       = _VDAC_OUTCTRL_ABUSPORTSELCH0_PORTD,
} VDAC_ChPortSel_t;

/*******************************************************************************
 *******************************   STRUCTS   ***********************************
 ******************************************************************************/

/** VDAC initialization structure, common for both channels. */
typedef struct {
  /** Number of prescaled CLK_DAC + 1 for the vdac to warmup. */
  uint32_t                    warmupTime;

  /** Halt during debug. */
  bool                        dbgHalt;

  /** Always allow clk_dac. */
  bool                        onDemandClk;

  /** DMA Wakeup. */
  bool                        dmaWakeUp;

  /** Bias keep warm enable. */
  bool                        biasKeepWarm;

  /** Channel refresh period. */
  VDAC_Refresh_TypeDef        refresh;

  /** Internal timer overflow period. */
  VDAC_TimerOverflow_TypeDef  timerOverflow;

  /** Prescaler for VDAC clock. Clock is source clock divided by prescaler+1. */
  uint32_t                    prescaler;

  /** Reference voltage to use. */
  VDAC_Ref_TypeDef            reference;

  /** Enable/disable reset of prescaler on CH 0 start. */
  bool                        ch0ResetPre;

  /** Sine reset mode. */
  bool                        sineReset;

  /** Enable/disable sine mode. */
  bool                        sineEnable;

  /** Select if single ended or differential output mode. */
  bool                        diff;
} VDAC_Init_TypeDef;

/** Default configuration for VDAC initialization structure. */
#define VDAC_INIT_DEFAULT                                                                            \
  {                                                                                                  \
    _VDAC_CFG_WARMUPTIME_DEFAULT, /* Number of prescaled DAC_CLK for Vdac to warmup. */              \
    false,                        /* Continue while debugging. */                                    \
    true,                         /* On demand clock. */                                             \
    false,                        /* DMA wake up. */                                                 \
    false,                        /* Bias keep warm. */                                              \
    vdacRefresh8,                 /* Refresh every 8th cycle. */                                     \
    vdacCycles2,                  /* Internal overflow every 8th cycle. */                           \
    0,                            /* No prescaling. */                                               \
    vdacRef1V25,                  /* 1.25 V internal low noise reference. */                         \
    false,                        /* Do not reset prescaler on CH 0 start. */                        \
    false,                        /* Sine wave is stopped at the sample its currently outputting. */ \
    false,                        /* Disable sine mode. */                                           \
    false                         /* Differential mode. */                                           \
  }

/** VDAC channel initialization structure. */
typedef struct {
  /** Enable channel. */
  bool                        enable;

  /** Warm-up mode, keep VDAC on (in idle) - or shutdown between conversions.*/
  bool                        warmupKeepOn;

  /** Select high capacitance load mode in conjunction with high power. */
  bool                        highCapLoadEnable;

  /** Channel x FIFO Low threshold data valid level. */
  uint32_t                    fifoLowDataThreshold;

  /** Channel refresh source. */
  VDAC_RefreshSource_TypeDef  chRefreshSource;

  /** Channel conversion trigger mode. */
  VDAC_TrigMode_TypeDef       trigMode;

  /** Channel power mode. */
  VDAC_PowerMode_TypeDef      powerMode;

  /** Set channel conversion mode to sample/shut-off mode. Default is
   *  continuous.*/
  bool                        sampleOffMode;

  /** Vdac channel output pin. */
  uint32_t                    pin;

  /** Vdac channel output port. */
  VDAC_ChPortSel_t            port;

  /** Short High power and low power output. */
  bool                        shortOutput;

  /**  Alternative output enable. */
  bool                        auxOutEnable;

  /**  Main output enable. */
  bool                        mainOutEnable;

  /**  Channel output hold time. */
  uint32_t                    holdOutTime;
} VDAC_InitChannel_TypeDef;

/** Default configuration for VDAC channel initialization structure. */
#define VDAC_INITCHANNEL_DEFAULT                                                      \
  {                                                                                   \
    false,                  /* Leave channel disabled when initialization is done. */ \
    false,                  /* Turn off between sample off conversions.*/             \
    true,                   /* Enable High cap mode. */                               \
    0,                      /* FIFO data low watermark at 0. */                       \
    vdacRefreshSrcNone,     /* Channel refresh source. */                             \
    vdacTrigModeSw,         /* Conversion trigged by CH0DATA or COMBDATA write. */    \
    vdacPowerModeHighPower, /* High power mode enabled. */                            \
    false,                  /* Continuous conversion mode. */                         \
    0,                      /* ABUS pin selected. */                                  \
    vdacChPortNone,         /* No Analog bus port selected. */                        \
    false,                  /* Output not shorted */                                  \
    false,                  /* Alternative output disabled. */                        \
    true,                   /* Main output enabled. */                                \
    0                       /* Hold out time. Previously called settle time */        \
  }

#endif
/*******************************************************************************
 *****************************   PROTOTYPES   **********************************
 ******************************************************************************/

void VDAC_ChannelOutputSet(VDAC_TypeDef *vdac,
                           unsigned int channel,
                           uint32_t     value);
void VDAC_Enable(VDAC_TypeDef *vdac, unsigned int ch, bool enable);
void VDAC_Init(VDAC_TypeDef *vdac, const VDAC_Init_TypeDef *init);
void VDAC_InitChannel(VDAC_TypeDef *vdac,
                      const VDAC_InitChannel_TypeDef *init,
                      unsigned int ch);

